Revit 2027 API
RebarBarType.GetCrankLength Method
 Gets the crank length taking into account the specified Rebar Crank Type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetCrankLength(
	ElementId rebarCrankTypeId
)
Public Function GetCrankLength (
	rebarCrankTypeId As ElementId
) As Double
public:
double GetCrankLength(
	ElementId^ rebarCrankTypeId
)
member GetCrankLength :
        rebarCrankTypeId : ElementId -> float
Parameters
rebarCrankTypeId ElementId
 The Rebar Crank Type id. Interactions with Rebar Crank Types can be done with the functions in [!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils].
Return Value
Double
 Returns the crank length.
Exceptions
Exception | Condition
ArgumentException |  The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST_RebarCrankType category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace